---
kind: property
id: P:Autodesk.Revit.DB.ReloadSwapOutInfo.WasSwapped
source: html/ae1c211d-cb28-83fc-5c5f-39c6bcf40c15.htm
---
# Autodesk.Revit.DB.ReloadSwapOutInfo.WasSwapped Property

Whether the swap out was successful.

## Syntax (C#)
```csharp
public bool WasSwapped { get; }
```